Repository: tsukinaha/tsukimi
Catalog: po/*.po
Languages: ta

source: Timeout Error, Check your internet connection
ta: காலக்கெடு பிழை, உங்கள் இணைய இணைப்பை சரிபார்க்கவும்

source: Connection Error, Check your internet connection
ta: இணைப்பு பிழை, உங்கள் இணைய இணைப்பை சரிபார்க்கவும்

source: No next up video found
ta: அடுத்த வீடியோ எதுவும் கிடைக்கவில்லை

source: Remove from favorites
ta: பிடித்தவைகளிலிருந்து அகற்று

source: Add to favorites
ta: பிடித்தவைகளில் சேர்க்கவும்

source: Password cannot be empty!
ta: கடவுச்சொல் காலியாக இருக்க முடியாது!

source: Passwords do not match!
ta: கடவுச்சொற்கள் பொருந்தவில்லை!

source: Password changed successfully! Please login again.
ta: கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டது! மீண்டும் உள்நுழைக.

source: Failed to change password
ta: கடவுச்சொல்லை மாற்றுவதில் தோல்வி

source: Cache Cleared
ta: கேச் அழிக்கப்பட்டது

source: No file selected
ta: எந்த கோப்பும் தேர்ந்தெடுக்கப்படவில்லை

source: Descriptor cannot be empty!
ta: விவரிப்பான் காலியாக இருக்க முடியாது!

source: Invalid regex
ta: தவறான ரீசெக்ச்

source: Disc
ta: வட்டு

source: Latest
ta: அண்மைக் கால

source: Favourite
ta: பிடித்த

source: Channels
ta: சேனல்கள்

source: All
ta: அனைத்தும்

source: Resume
ta: மீண்டும் தொடங்குங்கள்

source: BoxSet
ta: பாக்ச் செட்

source: Tags
ta: குறிச்சொற்கள்

source: Genres
ta: வகைகள்

source: Liked
ta: பிடித்திருந்தது

source: Folder
ta: கோப்புறை

source: Image copied to clipboard
ta: படம் இடைநிலைப்பலகைக்கு நகலெடுக்கப்பட்டது

source: Apply
ta: இடு

source: Are you sure you wish to continue?
ta: நீங்கள் தொடர விரும்புகிறீர்களா?

source: Cancel
ta: ரத்துசெய்

source: Ok
ta: சரி

source: More From
ta: மேலும்

source: Scanning...
ta: ச்கேனிங் ...

source: Shut down server
ta: சேவையகத்தை மூடு

source: Are you sure you want to shut down the server?
ta: சேவையகத்தை மூட விரும்புகிறீர்களா?

source: Restart server
ta: சேவையகத்தை மறுதொடக்கம் செய்யுங்கள்

source: Are you sure you want to restart the server?
ta: சேவையகத்தை மறுதொடக்கம் செய்ய விரும்புகிறீர்களா?

source: Revert
ta: மாற்றியமைக்கவும்

source: Confirm
ta: உறுதிப்படுத்தவும்

source: Server is shutting down
ta: சேவையகம் மூடப்படுகிறது

source: Server is restarting
ta: சேவையகம் மறுதொடக்கம் செய்கிறது

source: Last execute:
ta: கடைசியாக செயல்படுத்த:

source: Duration:
ta: காலம்:

source: Result:
ta: முடிவு:

source: Task started
ta: பணி தொடங்கியது

source: Fields must be filled in
ta: புலங்கள் நிரப்பப்பட வேண்டும்

source: Server edited successfully
ta: சேவையகம் வெற்றிகரமாக திருத்தப்பட்டது

source: Server added successfully
ta: சேவையகம் வெற்றிகரமாக சேர்க்கப்பட்டது

source: Items
ta: உருப்படிகள்

source: Play
ta: விளையாடுங்கள்

source: Codec
ta: புரிப்பு

source: Language
ta: மொழி

source: Title
ta: தலைப்பு

source: Bitrate
ta: பிட்ரேட்

source: BitDepth
ta: பிட்டெப்ட்

source: SampleRate
ta: மாதிரி

source: Height
ta: உயரம்

source: Width
ta: அகலம்

source: ColorSpace
ta: வண்ணங்கள்

source: DisplayTitle
ta: டிச்ப்ளே டிடில்

source: Channel
ta: வாய்க்கால்

source: ChannelLayout
ta: சேன்லேஅவுட்

source: AverageFrameRate
ta: சராசரி ஃபிரமரேட்

source: PixelFormat
ta: பிக்சல்ஃபார்மட்

source: No video source found
ta: வீடியோ மூலமும் கிடைக்கவில்லை

source: Season not found. Is this a continue watching list?
ta: சீசன் கிடைக்கவில்லை. இது தொடர்ந்து பார்க்கும் பட்டியலா?

source: Image saved
ta: படம் சேமிக்கப்பட்டது

source: Failed to load image
ta: படத்தை ஏற்றுவதில் தோல்வி

source: No image to view
ta: பார்க்க படம் இல்லை

source: No image to copy
ta: நகலெடுக்க படம் இல்லை

source: Image deleted
ta: படம் நீக்கப்பட்டது

source: Error deleting image
ta: படத்தை நீக்குவதில் பிழை

source: Replace Image
ta: படத்தை மாற்றவும்

source: Home
ta: வீடு

source: Search
ta: தேடல்

source: Server Panel
ta: சேவையக குழு

source: Fatal Error
ta: அபாயகரமான பிழை

source: Copy Error & Close
ta: பிழை மற்றும் மூடு

source: Windows Alert
ta: சாளரங்கள் எச்சரிக்கை

source: It seems you're using Tsukimi on Windows. Please note that GTK used by this application is designed for Linux, and no functionality is guaranteed to work on Windows, including but not limited to video rendering, audio playback, network connections, and external links. Additionally, there are known issues that cannot be fixed, such as black borders, image rendering, font rendering, DPI scaling, video rendering, GL renderer, fullscreen mode, HDR, and locale detection. If you wish to open an issue, please ensure that it is related to this software and not an upstream issue. Choose the appropriate issue template and fill in all required fields without any omissions.
ta: நீங்கள் சாளரங்களில் சுகிமியைப் பயன்படுத்துகிறீர்கள் என்று தெரிகிறது. இந்த பயன்பாட்டால் பயன்படுத்தப்படும் சி.டி.கே லினக்சிற்காக வடிவமைக்கப்பட்டுள்ளது என்பதை நினைவில் கொள்க, மேலும் வீடியோ வழங்குதல், ஆடியோ பிளேபேக், பிணையம் இணைப்புகள் மற்றும் வெளிப்புற இணைப்புகள் உள்ளிட்டவை அல்ல, ஆனால் அவை மட்டுமல்ல. கூடுதலாக, கருப்பு எல்லைகள், பட வழங்குதல், எழுத்துரு வழங்குதல், டிபிஐ அளவிடுதல், வீடியோ வழங்குதல், சிஎல் ரெண்டரர், ஃபுல்ச்கிரீன் பயன்முறை, எச்டிஆர் மற்றும் லோகேல் கண்டறிதல் போன்றவற்றை சரிசெய்ய முடியாத சிக்கல்கள் உள்ளன. நீங்கள் ஒரு சிக்கலைத் திறக்க விரும்பினால், இது இந்த மென்பொருளுடன் தொடர்புடையது என்பதை உறுதிப்படுத்தவும், மேலோடை சிக்கல் அல்ல. பொருத்தமான வெளியீட்டு வார்ப்புருவைத் தேர்ந்தெடுத்து, எந்த குறைபாடுகளும் இல்லாமல் தேவையான அனைத்து புலங்களையும் நிரப்பவும்.

source: Close
ta: மூடு

source: translator-credits
ta: மொழிபெயர்ப்பாளர்-வரவு

source: Present
ta: தற்போது

source: Success
ta: செய்

source: Delete Item
ta: உருப்படியை நீக்கு

source: Deleting this item will delete it from both the file system and your media library. The following files and folders will be deleted:
ta: இந்த உருப்படியை நீக்குவது கோப்பு முறைமை மற்றும் உங்கள் ஊடக நூலகம் இரண்டிலிருந்தும் அதை நீக்கிவிடும். பின்வரும் கோப்புகள் மற்றும் கோப்புறைகள் நீக்கப்படும்:

source: Delete
ta: நீக்கு

source: Remove Identification
ta: அடையாளத்தை அகற்று

source: Are you sure you wish to reset all metadata?
ta: எல்லா மெட்டாடேட்டாவையும் மீட்டமைக்க விரும்புகிறீர்களா?

source: Waiting for mediasource ...
ta: மீடியாசோர்சுக்காக காத்திருக்கிறது ...

source: Not implemented
ta: செயல்படுத்தப்படவில்லை

source: Special
ta: சிறப்பு

source: Failed to get path
ta: பாதையைப் பெறுவதில் தோல்வி

source: Identify
ta: அடையாளம் காணவும்

source: Replace existing images
ta: இருக்கும் படங்களை மாற்றவும்

source: Video filter settings cleared.
ta: வீடியோ வடிகட்டி அமைப்புகள் அழிக்கப்பட்டன.

source: Subtitle settings cleared.
ta: வசன அமைப்புகள் அழிக்கப்பட்டன.

source: Subtitle color settings cleared.
ta: வசன வண்ண அமைப்புகள் அழிக்கப்பட்டன.

source: Subtitle offset settings cleared.
ta: வசன ஆஃப்செட் அமைப்புகள் அழிக்கப்பட்டன.

source: Deband settings cleared.
ta: டெபாண்ட் அமைப்புகள் அழிக்கப்பட்டன.

source: Failed to get GLContext
ta: Glcontext ஐப் பெறுவதில் தோல்வி

source: Pause
ta: இடைநிறுத்தம்

source: No more video found
ta: மேலும் வீடியோ கிடைக்கவில்லை

source: MPV has been shutdown, Application will exit. Tsukimi can't restart MPV.
ta: MPV பணிநிறுத்தம் செய்யப்பட்டுள்ளது, விண்ணப்பம் வெளியேறும். சுகிமி எம்.பி.வி.யை மறுதொடக்கம் செய்ய முடியாது.

source: Mark as Played
ta: விளையாடியபடி குறி

source: Mark as Unplayed
ta: விளையாடப்படாததைக் குறிக்கவும்

source: Edit Metadata
ta: மெட்டாடேட்டாவைத் திருத்து

source: Edit Images
ta: படங்களைத் திருத்தவும்

source: _Copy Image
ta: _ கோபி படம்

source: Back
ta: பின்

source: Media Menu
ta: மீடியா பட்டியல்

source: Fullscreen
ta: முழு திரை

source: Exit Fullscreen
ta: முழுத்திரை வெளியேறவும்

source: Previous
ta: முந்தைய

source: Next
ta: அடுத்தது

source: Stop And Hide PlayerBar
ta: பிளேயர்பரை நிறுத்தி மறைக்கவும்

source: Repeat Mode
ta: மீண்டும் பயன்முறை

source: Repeat One
ta: ஒன்றை மீண்டும் செய்யவும்

source: Repeat All
ta: அனைத்தையும் மீண்டும் செய்யவும்

source: None
ta: எதுவுமில்லை

source: Remove
ta: அகற்று

source: Like
ta: போன்ற

source: Unlike
ta: போலல்லாமல்

source: View Missing Episodes
ta: காணாமல் போன அத்தியாயங்களைக் காண்க

source: Refresh Metadata
ta: மெட்டாடேட்டாவை புதுப்பிக்கவும்

source: Scan
ta: ச்கேன்

source: Restart Server
ta: சேவையகத்தை மறுதொடக்கம் செய்யுங்கள்

source: Shutdown Server
ta: பணிநிறுத்தம் சேவையகம்

source: System Logs
ta: கணினி பதிவுகள்

source: Activity Logs
ta: செயல்பாட்டு பதிவுகள்

source: Tasks
ta: பணிகள்

source: Backward
ta: பின்னோக்கு

source: Forward
ta: முன்னோக்கி

source: General
ta: பொது

source: Decrease/increase playback speed by 10%
ta: பிளேபேக் வேகத்தை 10% குறைக்க/அதிகரிக்கவும்

source: Halve/double current playback speed
ta: பாதி/இரட்டை தற்போதைய பின்னணி விரைவு

source: Reset playback speed to normal
ta: பிளேபேக் வேகத்தை இயல்புநிலைக்கு மீட்டமைக்கவும்

source: Change Poster
ta: சுவரொட்டியை மாற்றவும்

source: View
ta: பார்வை

source: Filter Panel
ta: வடிகட்டி குழு

source: Grid View
ta: கட்டம் பார்வை

source: List View
ta: பட்டியல் பார்வை

source: Ascending
ta: ஏறுதல்

source: Descending
ta: இறங்கு

source: Sort By
ta: வரிசைப்படுத்தவும்

source: Date Created
ta: தேதி உருவாக்கப்பட்டது

source: Imdb Rate
ta: IMDB வீதம்

source: Critic Rating
ta: விமர்சகர் மதிப்பீடு

source: Premiere Date
ta: பிரீமியர் தேதி

source: Offical Rating
ta: அதிகாரப்பூர்வ மதிப்பீடு

source: Production Year
ta: விளைவாக்கம் ஆண்டு

source: Date Played
ta: விளையாடிய தேதி

source: Runtime
ta: இயக்க நேரம்

source: Updated At
ta: இல் புதுப்பிக்கப்பட்டது

source: Nothing Here
ta: இங்கே எதுவும் இல்லை

source: Poster
ta: சுவரொட்டி

source: Backdrop
ta: பின்விடு

source: Banner
ta: பேனர்

source: Series
ta: தொடர்

source: Movie
ta: படம்

source: Person
ta: ஆள்

source: Music Album
ta: இசை ஆல்பம்

source: Audio
ta: ஆடியோ

source: Video
ta: ஒளிதோற்றம்

source: Episode
ta: அத்தியாயம்

source: Nothing Here or No type selected
ta: இங்கே எதுவும் இல்லை அல்லது வகை தேர்ந்தெடுக்கப்படவில்லை

source: Maybe you should try using different search terms
ta: ஒருவேளை நீங்கள் வெவ்வேறு தேடல் சொற்களைப் பயன்படுத்த முயற்சிக்க வேண்டும்

source: Advanced Settings
ta: மேம்பட்ட அமைப்புகள்

source: Seek Action
ta: நடவடிக்கை தேடுங்கள்

source: Seek Backward
ta: பின்தங்கிய தேடுங்கள்

source: Unit: Seconds
ta: அலகு: விநாடிகள்

source: Seek Forward
ta: முன்னோக்கி தேடுங்கள்

source: Cache
ta: கேச்

source: Show Buffer Speed
ta: இடையக வேகத்தைக் காட்டு

source: Cache Size
ta: கேச் அளவு

source: Unit: MB
ta: அலகு: எம்பி

source: Cache Time
ta: கேச் நேரம்

source: Subtitle
ta: வசன வரிகள்

source: Subtitle Composing
ta: வசன இசையமைத்தல்

source: Position
ta: நிலை

source: Subtitle Text Size
ta: வசன உரை அளவு

source: This option only takes effect for srt subtitles
ta: இந்த விருப்பம் எச்ஆர்டி வசனங்களுக்கு மட்டுமே நடைமுறைக்கு வருகிறது

source: Subtitle Text Scale
ta: வசன உரை அளவு

source: This affects ASS subtitles as well
ta: இது கழுதை வசனங்களையும் பாதிக்கிறது

source: Subtitle Text Font
ta: வசன உரை எழுத்துரு

source: Specify font to use for subtitles that do not themselves specify a particular font
ta: ஒரு குறிப்பிட்ட எழுத்துருவைக் குறிப்பிடாத வசன வரிகளுக்குப் பயன்படுத்த எழுத்துருவைக் குறிப்பிடவும்

source: Border Style
ta: எல்லை நடை

source: Outline and shadow
ta: அவுட்லைன் மற்றும் நிழல்

source: Opaque box
ta: ஒளிபுகா பெட்டி

source: Background box
ta: பின்னணி பெட்டி

source: Border Size
ta: எல்லை அளவு

source: Shadow Offset
ta: நிழல் ஆஃப்செட்

source: Stretch Image Subtitles to Screen
ta: திரைக்கு பட வசன வரிகள் நீட்டவும்

source: Subtitle Color
ta: வசன வண்ணம்

source: Text
ta: உரை

source: Border
ta: எல்லை

source: Background
ta: பின்னணி

source: Subtitle Offset
ta: வசன வரிகள் ஆஃப்செட்

source: Offset
ta: ஈடுசெய்யும்

source: Unit: ms
ta: அலகு: எம்.எச்

source: Speed
ta: வேகம்

source: Audio Offset
ta: ஆடியோ ஆஃப்செட்

source: Audio Channel
ta: ஆடியோ சேனல்

source: Auto
ta: தானி

source: Auto (Safety)
ta: ஆட்டோ (பாதுகாப்பு)

source: Mono
ta: மோனோ

source: Dual Channel
ta: இரட்டை சேனல்

source: Dual Channel (Invert)
ta: இரட்டை சேனல் (தலைகீழ்)

source: Video Aspect
ta: வீடியோ நற்பொருத்தம்

source: Fit
ta: பொருத்தம்

source: Crop
ta: பயிர்

source: Video color grading
ta: வீடியோ வண்ண தகுதி

source: Brightness
ta: ஒளி

source: Contrast
ta: மாறுபாடு

source: Saturation
ta: தெவிட்டல்

source: Hue
ta: வண்ணச்சாயல்

source: Gamma
ta: காமா

source: Video Deband
ta: வீடியோ டெபாண்ட்

source: Deband Iterations
ta: டெபாண்ட் மறு செய்கைகள்

source: Deband Threshold
ta: டெபாண்ட் வாசல்

source: Deband Range
ta: டெபாண்ட் வரம்பு

source: Deband Grain
ta: டெபாண்ட் தானியங்கள்

source: Video Deinterlace
ta: வீடியோ deinterlace

source: Video Upscale
ta: வீடியோ மேல்தட்டு

source: Action after video ends
ta: வீடியோ முடிந்ததும் நடவடிக்கை

source: Play Next
ta: அடுத்து விளையாடுங்கள்

source: Loop Playback
ta: லூப் பிளேபேக்

source: Stop
ta: நிறுத்து

source: Hardware decoding
ta: வன்பொருள் டிகோடிங்

source: no (default)
ta: இல்லை (இயல்புநிலை)

source: Not all settings will be saved
ta: எல்லா அமைப்புகளும் சேமிக்கப்படாது

source: _Next
ta: அடுத்தது (_N)

source: _Previous
ta: முன்தைய (_P)

source: Next chapter
ta: அடுத்த அத்தியாயம்

source: Previous chapter
ta: முந்தைய அத்தியாயம்

source: Playlist
ta: பிளேலிச்ட்

source: Advanced settings
ta: மேம்பட்ட அமைப்புகள்

source: Media info
ta: ஊடக செய்தி

source: _Keyboard shortcuts
ta: விசைப்பலகை குறுக்குவழிகள்

source: Add a New Server
ta: புதிய சேவையகத்தைச் சேர்க்கவும்

source: Enter the server details below.
ta: சேவையக விவரங்களை கீழே உள்ளிடவும்.

source: Name
ta: பெயர்

source: Server Address
ta: சேவையக முகவரி

source: Port
ta: துறைமுகம்

source: Username
ta: பயனர்பெயர்

source: Password
ta: கடவுச்சொல்

source: Add
ta: கூட்டு

source: Drag to reorder
ta: மறுவரிசைப்படுத்த இழுக்கவும்

source: Edit
ta: தொகு

source: Refresh
ta: புதுப்பிப்பு

source: Sign out
ta: விடுபதிகை

source: Preferences
ta: விருப்பத்தேர்வுகள்

source: About
ta: பற்றி

source: Add server
ta: சேவையகத்தைச் சேர்க்கவும்

source: No Server
ta: சேவையகம் இல்லை

source: Add Server
ta: சேவையகத்தைச் சேர்க்கவும்

source: Log Out
ta: விடுபதிகை

source: Contents
ta: உள்ளடக்கங்கள்

source: Servers
ta: சேவையகங்கள்

source: Library
ta: நூலகம்

source: Continue Watching
ta: தொடர்ந்து பார்த்துக் கொள்ளுங்கள்

source: Settings
ta: அமைப்புகள்

source: Preferred Language
ta: விருப்பமான மொழி

source: This is globally effective
ta: இது உலகளவில் பயனுள்ளதாக இருக்கும்

source: Preferred Audio Language
ta: விருப்பமான ஆடியோ மொழி

source: Default
ta: இயல்புநிலை

source: Preferred Subtitle Language
ta: விருப்பமான வசன மொழி

source: Appearence
ta: தோற்றம்

source: Accent Color
ta: உச்சரிப்பு நிறம்

source: Restart App To Take Effect
ta: பயன்பாட்டை மறுதொடக்கம் செய்யுங்கள்

source: Hide Sidebar
ta: பக்கப்பட்டியை மறைக்கவும்

source: Auto Select Last Server
ta: ஆட்டோ கடைசி சேவையகத்தைத் தேர்ந்தெடுக்கவும்

source: Network
ta: பிணையம்

source: Threads
ta: நூல்கள்

source: Excessive thread counts may exhaust the system's connection pool
ta: அதிகப்படியான நூல் எண்ணிக்கைகள் கணினியின் இணைப்புக் குளத்தை வெளியேற்றக்கூடும்

source: Refresh when returning to home page
ta: முகப்பு பக்கத்திற்குத் திரும்பும்போது புதுப்பிக்கவும்

source: This feature may cause significant lag. Please enable it with caution.
ta: இந்த நற்பொருத்தம் குறிப்பிடத்தக்க பின்னடைவை ஏற்படுத்தக்கூடும். தயவுசெய்து அதை எச்சரிக்கையுடன் இயக்கவும்.

source: Opacity
ta: ஒளிபுகாநிலை

source: Blur (Experimental)
ta: மங்கலான (சோதனை)

source: Warning: High GPU usage
ta: எச்சரிக்கை: உயர் சி.பீ.யூ பயன்பாடு

source: Blur Radius (Experimental)
ta: மங்கலான ஆரம் (சோதனை)

source: Clear Cache
ta: தெளிவான தற்காலிக சேமிப்பு

source: Others
ta: மற்றவர்கள்

source: Preferred Video Version
ta: விருப்பமான வீடியோ பதிப்பு

source: Account
ta: கணக்கு

source: Change Password
ta: கடவுச்சொல்லை மாற்றவும்

source: New Password
ta: புதிய கடவுச்சொல்

source: Confirm Password
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Media
ta: ஊடகம்

source: Music Player
ta: மியூசிக் பிளேயர்

source: Video Player
ta: வீடியோ பிளேயர்

source: Requires restart
ta: மறுதொடக்கம் தேவை

source: Enable external config
ta: வெளிப்புற கட்டமைப்பை இயக்கவும்

source: Config dir
ta: கட்டமைப்பு அடைவு

source: Video Output
ta: வீடியோ வெளியீடு

source: Only for debugging
ta: பிழைத்திருத்தத்திற்கு மட்டுமே

source: libmpv (default)
ta: libmpv (இயல்புநிலை)

source: Preferred Version
ta: விருப்பமான பதிப்பு

source: Weight is ordered from high to low, until a specific version is matched, or the highest matching version is obtained before clearing the match list
ta: ஒரு குறிப்பிட்ட பதிப்பு பொருந்தும் வரை, அல்லது மேட்ச் பட்டியலை அழிப்பதற்கு முன்பு அதிக பொருந்தக்கூடிய பதிப்பு பெறப்படும் வரை எடை அதிகமாக இருந்து குறைந்த வரை ஆர்டர் செய்யப்படுகிறது

source: Descriptors
ta: விவரிப்பவர்கள்

source: It is recommended to set no more than 3 lines
ta: 3 வரிகளுக்கு மேல் அமைக்க பரிந்துரைக்கப்படுகிறது

source: No Descriptors
ta: விளக்கங்கள் இல்லை

source: Add a descriptor
ta: ஒரு விவரிப்பாளரைச் சேர்க்கவும்

source: This will use exact matching to obtain a list
ta: பட்டியலைப் பெற இது சரியான பொருத்தத்தைப் பயன்படுத்தும்

source: Descriptor Type
ta: விவரிப்பான் வகை

source: String
ta: சரம்

source: Regular Expression
ta: வழக்கமான வெளிப்பாடு

source: Descriptor
ta: விவரிப்பான்

source: Descriptor should not be too long
ta: விவரிப்பான் மிக நீளமாக இருக்கக்கூடாது

source: eg. 1080p
ta: எ.கா. 1080 ப

source: eg. 1080p.*WebDL
ta: எ.கா. 1080p.*Webdl

source: Edit descriptor
ta: விவரிப்பைத் திருத்து

source: Save
ta: சேமி

source: Change folder
ta: கோப்புறையை மாற்றவும்

source: Select new mpv config folder
ta: புதிய MPV கட்டமைப்பு கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Stop and quit
ta: நிறுத்தி வெளியேறவும்

source: Media info (MPV)
ta: மீடியா செய்தி (எம்.பி.வி)

source: Playback speed
ta: பின்னணி விரைவு

source: Volume
ta: தொகுதி

source: Danmaku
ta: டென்மார்க்

source: No danmakus loaded
ta: டான்மகச் ஏற்றப்படவில்லை

source: Margin &amp; Size
ta: விளிம்பு &amp; அளவு

source: Top padding
ta: மேல் திணிப்பு

source: Font family
ta: எழுத்துரு குடும்பம்

source: Font size
ta: எழுத்துரு அளவு

source: Scroll danmaku max lines
ta: உருட்டல் டான்மகு அதிகபட்ச கோடுகள்

source: Topcenter danmaku max lines
ta: டாப் சென்டர் டான்மாகு அதிகபட்ச கோடுகள்

source: Bottomcenter danmaku max lines
ta: பாட்டம் சென்டர் டான்மாகு அதிகபட்ச கோடுகள்

source: Danmaku speed
ta: டான்மகு விரைவு

source: API from DanDanPlay
ta: Tandanplay இலிருந்து பநிஇ

source: No Inscriptions
ta: கல்வெட்டுகள் இல்லை

source: Actors
ta: நடிகர்கள்

source: Studios
ta: ச்டுடியோச்

source: Links
ta: இணைப்புகள்

source: Loading...
ta: ஏற்றுகிறது ...

source: Video:
ta: வீடியோ:

source: Subtitle:
ta: வசன வரிகள்:

source: View this season
ta: இந்த பருவத்தைக் காண்க

source: Included In
ta: இதில் சேர்க்கப்பட்டுள்ளது

source: Additional Parts
ta: கூடுதல் பாகங்கள்

source: Seasons
ta: பருவங்கள்

source: Recommend
ta: பரிந்துரைக்கவும்

source: MediaInfo
ta: மீடியாஇன்ஃபோ

source: Not Available
ta: கிடைக்கவில்லை

source: This page is READ-ONLY, because you have no permission to modify it.
ta: இந்த பக்கம் படிக்க மட்டுமே, ஏனெனில் அதை மாற்ற உங்களுக்கு இசைவு இல்லை.

source: Path
ta: பாதை

source: No data.
ta: தரவு இல்லை.

source: Sort Title
ta: வரிசை தலைப்பு

source: Pick Date
ta: தேதியைத் தேர்ந்தெடுங்கள்

source: Pick Time
ta: நேரம் தேர்வு

source: Overview
ta: கண்ணோட்டம்

source: External Ids
ta: வெளிப்புற ஐடிகள்

source: TheMovieDb Id
ta: Themoviedb ஐடி

source: TheTVDb Id
ta: Thetvdb ஐடி

source: IMDb Id
ta: IMDB ஐடி

source: Lock The Item
ta: உருப்படியைப் பூட்டவும்

source: Replace All Metadata
ta: அனைத்து மெட்டாடேட்டாவையும் மாற்றவும்

source: Replace All Images
ta: எல்லா படங்களையும் மாற்றவும்

source: Open
ta: திற

source: Pick Image
ta: படத்தைத் தேர்ந்தெடுங்கள்

source: Images
ta: படங்கள்

source: Pick image to upload
ta: பதிவேற்ற படத்தைத் தேர்ந்தெடுக்கவும்

source: BackDrops
ta: பின்விடுகள்

source: Edit Image
ta: படத்தைத் திருத்து

source: Upload Image
ta: படத்தைப் பதிவேற்று

source: External Url
ta: வெளிப்புற முகவரி

source: Copy Image To Clipboard
ta: இடைநிலைப் பலகைக்கு படத்தை நகலெடுக்கவும்

source: View Image
ta: படத்தைக் காண்க

source: Enter one or more search criteria. Remove criteria to increase search results.
ta: ஒன்று அல்லது அதற்கு மேற்பட்ட தேடல் அளவுகோல்களை உள்ளிடவும். தேடல் முடிவுகளை அதிகரிக்க அளவுகோல்களை அகற்று.

source: Year
ta: ஆண்டு

source: External
ta: வெளிப்புறம்

source: Choose Image
ta: படத்தைத் தேர்வுசெய்

source: Provider:
ta: வழங்குநர்:

source: Provider
ta: வழங்குநர்

source: All Languages
ta: அனைத்து மொழிகளும்

source: Follow system style
ta: கணினி பாணியைப் பின்பற்றுங்கள்

source: Light style
ta: ஒளி நடை

source: Dark style
ta: இருண்ட நடை

source: Filters
ta: வடிப்பான்கள்

source: Playback Status
ta: பிளேபேக் நிலை

source: Any
ta: ஏதேனும்

source: Played
ta: விளையாடியது

source: Unplayed
ta: விளையாடப்படாதது

source: Continue Play
ta: தொடர்ந்து விளையாடுங்கள்

source: Years
ta: ஆண்டுகள்

source: Official Ratings
ta: அதிகாரப்பூர்வ மதிப்பீடுகள்

source: Media Info
ta: ஊடக செய்தி

source: Containers
ta: கொள்கலன்கள்

source: Encoders
ta: குறியாக்கிகள்

source: Video Types
ta: வீடியோ வகைகள்

source: Resolution
ta: பகுத்தல்

source: Clear
ta: தெளிவான

source: Missing Episodes
ta: எபிசோடுகளைக் காணவில்லை

source: Specials
ta: சிறப்பு

source: Upcoming
ta: வரவிருக்கும்
