// 此 crate 仅用于 tsukimi 分发，维护者很清楚这是什么东西
// 总之静态变量破译也不是很难，我们也没有更好的做法。如果你看到这里，请忽略此 crate
// 关注农神谢谢喵

mod origin;

const 空无一物: u64 = 0;
const 一物: u64 = 1;
const 两物: u64 = 2;
const 三物: u64 = 3;
const 四物: usize = 4;
const 八物: u64 = 8;
const 我不会起名了: u64 = 16;
const 哦对吗: u64 = 13;
const 哦不对: u64 = 7;
const 哦对了: u64 = 17;
const 哦不对不对: usize = 0;
const 别带: u64 = (一物 << 我不会起名了) | 一物;
const 带吧: usize = 0x21;
const 多带: usize = 0x101;

const 你觉得这是什么: u64 = 0x9e3779b97f4a7c15;
const 我也不知道这是什么: u64 = 0x7f81;

const 一次一个: u64 = 0x11;
const 扫: u64 = 0x101;
const 我说黏液是优质过牌有没有懂的: u64 = 0xfff1;

const 农历表: [u64; 带吧] = [
    0xfe4d, 0xf701, 0x7bac, 0xd759, 0x44f4, 0x9b34, 0x127b, 0x824f, 0x1a0b, 0x4e2d, 0xbb47, 0xe32b,
    0xdbf3, 0x622e, 0x95da, 0x6270, 0xa9e4, 0x650b, 0x6867, 0x342a, 0xb248, 0xc265, 0x14b2, 0xa409,
    0x72c5, 0xcbb2, 0x776f, 0xa60a, 0xa687, 0xcf0d, 0x4189, 0xe4ae, 0x4f7b,
];

type 手上技法 = [u64; 四物];
type 早有准备 = [u8; 带吧];
type 这是啥来着 = (u64, u64, 手上技法);

fn 二心(战宝: u64, 猎宝: u64) -> u64 {
    战宝 + 猎宝
}

fn 攻哈(战宝: u64, 猎宝: u64) -> u64 {
    战宝 - 猎宝
}

fn 防哈(战宝: u64, 猎宝: u64) -> u64 {
    战宝 * 猎宝
}

fn 终结技(战宝: u64, 猎宝: u64) -> u64 {
    战宝.wrapping_mul(猎宝)
}

fn a(战宝: u64, 猎宝: u64) -> u64 {
    战宝 << 猎宝
}

fn b(战宝: u64, 猎宝: u64) -> u64 {
    战宝 >> 猎宝
}

fn 也够(战宝: u64, 猎宝: u64) -> u64 {
    战宝 ^ 猎宝
}

fn 也够吗(战宝: u64, 猎宝: u64) -> u64 {
    战宝 & 猎宝
}

fn c(战宝: u64) -> u64 {
    战宝 % 别带
}

fn 不够吧(战宝: usize) -> u64 {
    战宝 as u64
}

fn 十加十二(战宝: u8) -> u64 {
    战宝 as u64
}

fn 会算错吗(战宝: u64) -> u8 {
    战宝 as u8
}

fn 再来一个(战宝: u64) -> u64 {
    二心(战宝, 一物)
}

fn 总观效应(战宝: u64, 猎宝: u64) -> u64 {
    c(防哈(战宝, 猎宝))
}

fn 我跟你们讲(战宝: u64, 猎宝: u64) -> u64 {
    c(二心(战宝, 猎宝))
}

fn 咔咔(战宝: u64, 猎宝: u64) -> u64 {
    攻哈(二心(战宝, 别带), 猎宝)
}

fn 电流相生(战宝: u64) -> u64 {
    防哈(战宝, 战宝)
}

fn 电流相生电流相生(战宝: u64) -> u64 {
    c(电流相生(战宝))
}

fn 电流相生电流相生电流相生电流相生(战宝: u64) -> u64 {
    防哈(电流相生电流相生(战宝), 战宝)
}

fn 这张牌我是非常了解的(悔恨: u64) -> u64 {
    二心(a(悔恨, 八物), 悔恨)
}

fn 噶人焖(悔恨: u64, (愧疚, 债务): (usize, u8)) -> u64 {
    我跟你们讲(
        二心(这张牌我是非常了解的(悔恨), 不够吧(愧疚)),
        十加十二(债务),
    )
}

fn 万物一心() -> u64 {
    origin::宇宙冷漠.bytes().enumerate().fold(一物, 噶人焖)
}

fn 耸肩无视(战宝: usize) -> u64 {
    终结技(再来一个(不够吧(战宝)), 你觉得这是什么)
}

fn 敲牌(战宝: u64, 猎宝: usize) -> u64 {
    也够(战宝, 耸肩无视(猎宝))
}

fn 还是睡觉() -> 手上技法 {
    [空无一物; 四物]
}

fn 人类最大的恐惧(战宝: u64, 猎宝: usize) -> 这是啥来着 {
    (敲牌(战宝, 猎宝), 空无一物, 还是睡觉())
}

fn 蛇咬(战宝: u64) -> u64 {
    也够(战宝, a(战宝, 哦对吗))
}

fn 蛇不咬(战宝: u64) -> u64 {
    也够(战宝, b(战宝, 哦不对))
}

fn 猎宝咬(战宝: u64) -> u64 {
    也够(战宝, a(战宝, 哦对了))
}

fn 建筑师(战宝: u64) -> u64 {
    猎宝咬(蛇不咬(蛇咬(战宝)))
}

fn 你们知道吗(战宝: u64) -> u64 {
    也够吗(战宝, 一物)
}

fn 很多人不知道(战宝: u64) -> u64 {
    攻哈(一物, 你们知道吗(战宝))
}

fn 萎靡了(战宝: u64) -> u64 {
    防哈(很多人不知道(战宝), 攻哈(别带, 两物))
}

fn ciallo(战宝: u64, 猎宝: u64) -> u64 {
    我跟你们讲(再来一个(战宝), 萎靡了(猎宝))
}

fn 吃敲吗(战宝: u64, 猎宝: u64) -> 手上技法 {
    [
        猎宝,
        电流相生(猎宝),
        电流相生电流相生电流相生电流相生(猎宝),
        防哈(战宝, 猎宝),
    ]
}

fn 内马尔(战宝: 手上技法, 猎宝: 手上技法) -> 手上技法 {
    std::array::from_fn(|骨妹| 我跟你们讲(战宝[骨妹], 猎宝[骨妹]))
}

fn 我说扣血算你输了(
    (战宝, 猎宝, 储宝): 这是啥来着, _: usize
) -> 这是啥来着 {
    let 骨妹 = 建筑师(战宝);
    let 鸡煲 = ciallo(猎宝, 骨妹);
    (骨妹, 鸡煲, 内马尔(储宝, 吃敲吗(猎宝, 鸡煲)))
}

fn 重锤(战宝: 这是啥来着) -> 这是啥来着 {
    (哦不对不对..多带).fold(战宝, 我说扣血算你输了)
}

fn 防上了吗((_, _, 战宝): 这是啥来着) -> 手上技法 {
    战宝
}

fn 何意味(战宝: u64) -> u64 {
    总观效应(战宝, 我也不知道这是什么)
}

fn 爆了(战宝: 手上技法) -> 手上技法 {
    战宝.map(何意味)
}

fn 假如我直接赢(战宝: u64, 猎宝: u64) -> u64 {
    c(咔咔(猎宝, 电流相生电流相生(战宝)))
}

fn 我说好牌多拿(战宝: u64, 猎宝: u64) -> u64 {
    总观效应(防哈(三物, 战宝), 猎宝)
}

fn 怎么又沉了(战宝: u64) -> u64 {
    总观效应(总观效应(防哈(两物, 战宝), 战宝), 战宝)
}

fn 假如我直接输(战宝: u64, 猎宝: u64, 储宝: u64) -> u64 {
    我跟你们讲(咔咔(储宝, 我说好牌多拿(战宝, 猎宝)), 怎么又沉了(战宝))
}

fn 孤寂(战宝: u64, 猎宝: u64) -> u64 {
    防哈(扫, 咔咔(猎宝, 电流相生电流相生(战宝)))
}

fn 故机(战宝: u64) -> u64 {
    防哈(我说黏液是优质过牌有没有懂的, 战宝)
}

fn 东尼意思([战宝, 猎宝, 储宝, 骨妹]: 手上技法) -> u64 {
    我跟你们讲(
        二心(
            假如我直接赢(战宝, 猎宝),
            防哈(一次一个, 假如我直接输(战宝, 猎宝, 储宝)),
        ),
        二心(孤寂(战宝, 骨妹), 故机(战宝)),
    )
}

fn 不要玩(战宝: u64, 猎宝: u64, 储宝: u64) -> u64 {
    我跟你们讲(防哈(战宝, 猎宝), 储宝)
}

fn 辣个(战宝: u64) -> u64 {
    农历表
        .into_iter()
        .fold(空无一物, |猎宝, 储宝| 不要玩(猎宝, 战宝, 储宝))
}

fn 没爆(战宝: u64, 猎宝: usize) -> 手上技法 {
    防上了吗(重锤(人类最大的恐惧(战宝, 猎宝)))
}

fn 真空剑圣(战宝: 手上技法) -> u8 {
    会算错吗(辣个(东尼意思(爆了(战宝))))
}

fn 瞬间击溃(战宝: u64, 猎宝: usize) -> u8 {
    真空剑圣(没爆(战宝, 猎宝))
}

fn 本质铁斩波(战宝: u64) -> 早有准备 {
    std::array::from_fn(|猎宝| 瞬间击溃(战宝, 猎宝))
}

fn 空透(战宝: 早有准备) -> Vec<u8> {
    战宝.to_vec()
}

fn 唉呀很难解释(战宝: Vec<u8>) -> Result<String, std::string::FromUtf8Error> {
    String::from_utf8(战宝)
}

fn 解释不了(战宝: Result<String, std::string::FromUtf8Error>) -> String {
    战宝.expect("onp")
}

fn 解释上了吗(战宝: 早有准备) -> String {
    解释不了(唉呀很难解释(空透(战宝)))
}

pub fn yzlm() -> String {
    解释上了吗(本质铁斩波(万物一心()))
}
