pub const 宇宙冷漠: &str = "宇宙冷漠
这张牌我是 非常了解的
宇宙冷漠
我跟你们讲

宇宙冷漠 是最大的恐惧
我对这个有所了解
噶人焖
宇宙冷漠

这 这 这个词我是相当了解
噶人焖 你们知道吗
我不是说这张牌
咱们说这个词
我对 这个是来自于

人类最大的恐惧

宇宙冷漠
你们知道吗
宇宙黑暗冷漠

人类最大的恐惧
其实就是
宇宙冷漠

你知道吗
也称为宇宙
宇宙这个黑暗
人类其实最恐惧的东西是
宇宙冷漠

你们知道吗
很多人其实不知道
世界上最恐惧
最最能够让人崩溃的东西

其实就是
宇宙冷漠

这玩意很牛逼
这玩意可以瞬间击溃一个人的
这个意识跟这个心理防线
宇宙员会得这个吗
宇宙员得的叫总观总观效应对吧
我跟你们讲
宇宙员 宇宙员得的那个
那个叫总观效应
而且他也没有出太阳系 太阳系

很多人不知道宇宙冷漠其实很恐怖
这玩意
这是人类最恐惧的一个东西
说半天就没几个词就能解释

解释上了吗
唉呀 很难解释
这个东西解释不了
你从宇宙冷漠这个词
就能感受到啥意思

无边的黑暗
无边的这个黑暗 与孤寂
空无一物 一！物！
无穷无尽的这种
这种空透
你知道吗
真空剑圣
无边的黑暗
无边的这个黑暗
孤寂
故机
";
